[
    {
      "modality_id": 5,
      "modality_name": "ADC",
      "modality_category": "Engineered Biologics",
      "label": "NBE",
      "short_description": "Antibody-Drug Conjugates represent a complex dual-stream manufacturing scenario, combining biologics manufacturing with HPAPI (cytotoxic payload) synthesis. Rapid growth segment expanding into non-oncology applications. Requires site-specific conjugation technologies, OEB4 containment for payload, and advanced analytics to control drug-to-antibody ratio (DAR).",
      "description": "",
      "standard_challenges": [
        "Antibody-Drug Conjugate (ADC) Manufacturing",
        "High-Potency Active Pharmaceutical Ingredient (HPAPI) Handling"
      ],
      "created_at": "2025-09-22 07:54:32.809167+00:00"
    },
    {
      "modality_id": 10,
      "modality_name": "Bacteria",
      "modality_category": "Advanced Therapy",
      "label": "NBE (ntm)",
      "short_description": "Live biotherapeutics including engineered bacteria for therapeutic applications. Requires specialized containment and controlled atmosphere processing, bacterial fermentation capabilities, and unique regulatory considerations for living organisms. Emerging field with growing pipeline especially in microbiome and oncology applications.",
      "description": "",
      "standard_challenges": [
        "Live Organism Manufacturing",
        "Specialized Containment",
        "Bacterial Fermentation"
      ],
      "created_at": "2025-09-22 07:54:32.809167+00:00"
    },
    {
      "modality_id": 15,
      "modality_name": "Base/Prime Editing",
      "modality_category": "Emerging Therapy",
      "label": "NBE (ntm)",
      "short_description": "Precise genetic modifications beyond traditional CRISPR with improved specificity and reduced off-target effects. Next-generation gene editing technologies offering more precise therapeutic interventions. Requires specialized delivery systems and advanced manufacturing for editing components.",
      "description": "",
      "standard_challenges": [
        "Precision Gene Editing Manufacturing",
        "Advanced Delivery Systems",
        "Component Stability"
      ],
      "created_at": "2025-09-22 07:54:32.809167+00:00"
    },
    {
      "modality_id": 12,
      "modality_name": "CAR-NK",
      "modality_category": "Emerging Therapy",
      "label": "NBE (ntm)",
      "short_description": "CAR-Natural Killer cell therapies offering manufacturing advantages over CAR-T with potential for allogeneic approaches. In vivo approaches are being developed to reduce manufacturing complexity. Alternative to CAR-T for solid tumor applications with potentially broader clinical utility and reduced manufacturing burden.",
      "description": "",
      "standard_challenges": [
        "Cell Engineering",
        "Allogeneic Processing",
        "In Vivo Delivery"
      ],
      "created_at": "2025-09-22 07:54:32.809167+00:00"
    },
    {
      "modality_id": 9,
      "modality_name": "Gene Therapy",
      "modality_category": "Advanced Therapy",
      "label": "NBE (ntm)",
      "short_description": "Genetic material modification approaches including AAV vectors, lentiviral vectors, and oncolytic viruses (OV/CV). Beyond BSL-2+ containment requirements, requires specialized cell culture systems for viral replication, advanced purification to separate viral particles from cell debris, extensive viral safety testing (e.g., for RCV), and complex process development.",
      "description": "",
      "standard_challenges": [
        "Viral Vector / Gene Therapy Manufacturing",
        "BSL-2+ Containment Facilities required",
        "Viral Safety Testing"
      ],
      "created_at": "2025-09-22 07:54:32.809167+00:00"
    },
    {
      "modality_id": 2,
      "modality_name": "Monoclonal Antibody",
      "modality_category": "Biologics",
      "label": "NBE",
      "short_description": "Standard monoclonal antibodies (mAbs) targeting specific antigens. Largest established biologics class, expanding beyond oncology into Alzheimer's and other indications. Requires cell culture systems, downstream purification, and cold chain logistics. Well-established manufacturing processes but requires high titer production and complex purification.",
      "description": "",
      "standard_challenges": [
        "High Titer Production",
        "Downstream Purification",
        "Cold Chain Logistics"
      ],
      "created_at": "2025-09-22 07:54:32.809167+00:00"
    },
    {
      "modality_id": 7,
      "modality_name": "PROTAC",
      "modality_category": "Engineered Biologics",
      "label": "NCE (solid)",
      "short_description": "Proteolysis Targeting Chimeras are targeted protein degraders representing the fastest growing market segment. Highly complex manufacturing involving multi-component synthesis, precise linker chemistry, and advanced purification for high molecular weight (>1000 Da) compounds. Pose significant formulation and bioavailability challenges while targeting previously 'undruggable' proteins.",
      "description": "",
      "standard_challenges": [
        "PROTAC Manufacturing",
        "Complex Synthesis",
        "Advanced Formulation"
      ],
      "created_at": "2025-09-22 07:54:32.809167+00:00"
    },
    {
      "modality_id": 11,
      "modality_name": "Oligonucleotides",
      "modality_category": "Nucleic Acids",
      "label": "NCE (liquid)",
      "short_description": "Gene expression modulation therapies including antisense oligonucleotides (ASOs) that bind mRNA to inhibit translation/alter splicing, small interfering RNA (siRNA) that induce target mRNA degradation, and messenger RNA (mRNA) therapies that deliver therapeutic proteins. Requires specialized solid-phase synthesis, complex HPLC purification, stability management, and delivery system integration (LNPs, conjugates).",
      "description": "",
      "standard_challenges": [
        "Specialized Solid-Phase Synthesis",
        "Complex Purification",
        "Delivery System Integration",
        "Stability Management"
      ],
      "created_at": "2025-09-22 07:54:32.809167+00:00"
    },
    {
      "modality_id": 3,
      "modality_name": "Peptides",
      "modality_category": "Biologics",
      "label": "NCE (liquid)",
      "short_description": "Therapeutic peptides including multi-agonists, modified peptides, and peptide drug conjugates. Requires specialized Solid-Phase Peptide Synthesis (SPPS), advanced purification, and precise control of stereochemistry. Examples include GLP-1R/GIPR agonists like Survodutide. Often requires device integration for delivery and cold chain management.",
      "description": "",
      "standard_challenges": [
        "Advanced Peptide Manufacturing",
        "Device & Combination Product Manufacturing",
        "Cold Chain Logistics"
      ],
      "created_at": "2025-09-22 07:54:32.809167+00:00"
    },
    {
      "modality_id": 6,
      "modality_name": "Recombinant Proteins",
      "modality_category": "Biologics",
      "label": "NBE",
      "short_description": "Engineered proteins including fusion proteins, complex receptor modulators, and proteins that are not standard monoclonal antibodies. Requires specialized process development for expression, purification, and analytical characterization to ensure proper structure and function. Examples include DcR3-Fc fusion proteins and FZD4_LRP5 modulators.",
      "description": "",
      "standard_challenges": [
        "Complex Biologics Manufacturing",
        "Advanced Purification"
      ],
      "created_at": "2025-09-22 07:54:32.809167+00:00"
    },
    {
      "modality_id": 1,
      "modality_name": "Small Molecule",
      "modality_category": "Traditional",
      "label": "NCE (solid)",
      "short_description": "Traditional chemically synthesized compounds (NCEs - New Chemical Entities). Steady FDA approval rates with well-established manufacturing processes including synthesis, purification, and formulation. Includes compounds requiring high-selectivity synthesis, covalent inhibitor stability management, and specialized formulations like amorphous solid dispersions for poorly soluble compounds.",
      "description": "",
      "standard_challenges": [
        "High-Selectivity Synthesis",
        "Covalent Inhibitor Stability",
        "Amorphous Solid Dispersion Manufacturing"
      ],
      "created_at": "2025-09-22 07:54:32.809167+00:00"
    },
    {
      "modality_id": 4,
      "modality_name": "T-cell Engager",
      "modality_category": "Engineered Biologics",
      "label": "NBE (ntm)",
      "short_description": "Bispecific antibodies that engage T-cells to target cancer cells through two-target engagement mechanisms. Requires complex protein engineering and specialized expression systems (e.g., BI-HEX® platform) to ensure correct heavy/light chain pairing and prevent mispairing and aggregation. Examples include B7-H6/CD3 and ALPG/CD3 T-cell engagers.",
      "description": "",
      "standard_challenges": [
        "Bispecific/Multi-specific Antibody Manufacturing",
        "Complex Biologics Manufacturing"
      ],
      "created_at": "2025-09-22 07:54:32.809167+00:00"
    },
    {
      "modality_id": 13,
      "modality_name": "TCR-T",
      "modality_category": "Emerging Therapy",
      "label": "NBE (ntm)",
      "short_description": "T-cell Receptor therapies designed for solid tumor applications, broadening clinical utility beyond CAR-T applications. Requires T-cell engineering with TCR modification, specialized processing similar to CAR-T but with different target recognition mechanisms. Growing pipeline for solid tumor indications.",
      "description": "",
      "standard_challenges": [
        "T-cell Engineering",
        "Solid Tumor Targeting",
        "TCR Manufacturing"
      ],
      "created_at": "2025-09-22 07:54:32.809167+00:00"
    },
    {
      "modality_id": 14,
      "modality_name": "Trispecific Antibodies",
      "modality_category": "Emerging Biologics",
      "label": "NBE",
      "short_description": "Three-target engagement antibodies for enhanced cancer immunotherapy efficacy. Even more complex than bispecific antibodies, requiring sophisticated protein engineering to ensure correct multi-chain pairing and prevent aggregation. Novel therapeutic mechanisms with enhanced specificity and efficacy potential.",
      "description": "",
      "standard_challenges": [
        "Multi-specific Antibody Manufacturing",
        "Complex Protein Engineering",
        "Advanced Analytics"
      ],
      "created_at": "2025-09-22 07:54:32.809167+00:00"
    },
    {
      "modality_id": 8,
      "modality_name": "CAR-T",
      "modality_category": "Advanced Therapy",
      "label": "NBE (ntm)",
      "short_description": "Chimeric Antigen Receptor T-cell therapies, a form of personalized immunotherapy established in hematologic malignancies. Requires autologous cell collection and processing, viral transduction for CAR gene insertion, controlled cell expansion, quality control, cryopreservation, and patient-specific logistics with extremely tight timelines. Highest manufacturing complexity due to personalized medicine requirements.",
      "description": "",
      "standard_challenges": [
        "Personalized Manufacturing",
        "Autologous Cell Processing",
        "Viral Transduction",
        "Cryopreservation",
        "Patient-Specific Logistics"
      ],
      "created_at": "2025-09-22 07:54:32.809167+00:00"
    },
    {
      "modality_id": 16,
      "modality_name": "Molecular Glues",
      "modality_category": "Emerging Biologics",
      "label": "NCE (solid)",
      "short_description": "Novel protein degradation approach targeting previously 'undruggable' proteins through induced protein-protein interactions. Different mechanism from PROTACs but similar complexity in targeting protein degradation pathways. Requires specialized synthesis and formulation approaches.",
      "description": "",
      "standard_challenges": [
        "Novel Protein Degradation Manufacturing",
        "Specialized Synthesis",
        "Target Validation"
      ],
      "created_at": "2025-09-22 07:54:32.809167+00:00"
    },
    {
      "modality_id": 17,
      "modality_name": "Radiopharmaceuticals",
      "modality_category": "Emerging Therapy",
      "label": "NCE (liquid)",
      "short_description": "Targeted radioactive isotope delivery for cancer therapy. Requires specialized facilities for radioactive material handling, precise isotope incorporation, short half-life management, and specialized containment and logistics. Growing field for targeted cancer treatment with unique manufacturing and regulatory challenges.",
      "description": "",
      "standard_challenges": [
        "Radioactive Material Handling",
        "Isotope Manufacturing",
        "Specialized Containment",
        "Short Half-Life Logistics"
      ],
      "created_at": "2025-09-22 07:54:32.809167+00:00"
    },
    {
      "modality_id": 18,
      "modality_name": "Stem Cell Therapies",
      "modality_category": "Advanced Therapy",
      "label": "NBE (ntm)",
      "short_description": "Tissue repair and regenerative applications using various stem cell types. Growing pipeline especially in oncology and rare diseases. Requires specialized cell culture, cell banking, quality control for cellular products, and often autologous or allogeneic processing depending on application.",
      "description": "",
      "standard_challenges": [
        "Stem Cell Culture",
        "Cell Banking",
        "Regenerative Manufacturing",
        "Cellular Quality Control"
      ],
      "created_at": "2025-09-22 07:54:32.809167+00:00"
    },
    {
    "modality_id": 20,
    "modality_name": "Prescription Digital Therapeutic (SaMD/PDT)",
    "modality_category": "Digital Therapeutics",
    "label": "DTx",
    "short_description": "Software-based medical interventions regulated as Software as a Medical Device (SaMD). Prescription Digital Therapeutics (PDTs) deliver evidence-based therapeutic interventions to prevent, manage, or treat a medical disorder or disease. Delivered via mobile or web platforms, often adjunctive to pharmacotherapy, and require clinical validation through RCTs.",
    "description": "Digital therapeutics represent a new class of regulated medical products that use software to achieve therapeutic outcomes. Unlike wellness apps, PDTs undergo rigorous clinical evaluation and regulatory review. They require compliance with SaMD standards (e.g., IEC 62304), cybersecurity, data privacy (GDPR/HIPAA), and integration into healthcare workflows. Common use cases include mental health, chronic disease management, and adjunctive therapy in CNS disorders.",
    "standard_challenges": [
      "Regulatory compliance for SaMD (FDA, EMA, MDR)",
      "Quality Management System (QMS) for software lifecycle",
      "Cybersecurity and data privacy (GDPR, HIPAA)",
      "Clinical validation and real-world evidence generation",
      "Patient engagement and adherence",
      "Payer coverage and reimbursement pathways"
    ],
    "created_at": "2025-09-25 14:30:00.000000+00:00"
  },
  {
  "modality_id": 19,
  "modality_name": "Onkolytische Viren",
  "modality_category": "Advanced Therapy",
  "label": "NBE (ntm)",
  "short_description": "Gentechnisch optimierte Viren, die selektiv Tumorzellen infizieren, zerstören (Onkolyse) und gleichzeitig eine systemische Anti-Tumor-Immunantwort auslösen. Die Herstellung erfordert eine virologische GMP-Infrastruktur mit adäquater Biosicherheitsstufe (z.B. BSL-2+).",
  "description": "",
  "standard_challenges": [
    "Oncolytic Virus Manufacturing",
    "BSL-2+ Containment",
    "Immune Response Potency Assays"
  ],
  "created_at": "2025-09-22 07:54:32.809167+00:00"
}
]