[
  {
    "technology_name": "Multi-Step Organic Synthesis",
    "stage_name": "Chemical/Biological Production",
    "modality_names": [
      "Small Molecule"
    ],
    "short_description": "Sequential chemical reactions for small molecule API synthesis",
    "description": "Complex multi-step synthetic pathways involving sequential chemical transformations to produce small molecule APIs. Requires precise control of reaction conditions, temperature, pH, and timing across multiple synthetic steps to achieve target purity and yield. Essential for most pharmaceutical active ingredients.",
    "innovation_potential": "Medium",
    "complexity_rating": 6
  },
  {
    "technology_name": "Continuous Flow Chemistry",
    "stage_name": "Process Intensification",
    "modality_names": [
      "Small Molecule"
    ],
    "short_description": "Continuous chemical synthesis in controlled flow systems",
    "description": "Advanced continuous manufacturing technology enabling precise control of reaction parameters through miniaturized flow reactors. Offers improved safety, reduced reaction times, better temperature control, and enables reactions not feasible in batch mode. Key enabler for pharmaceutical process intensification.",
    "innovation_potential": "High",
    "complexity_rating": 7
  },
  {
    "technology_name": "Cryogenic Reaction Technology",
    "stage_name": "Process Intensification",
    "modality_names": [
      "Small Molecule"
    ],
    "short_description": "Ultra-low temperature chemical synthesis systems",
    "description": "Specialized reaction systems operating at extremely low temperatures (-78°C to -196°C) to enable unique chemical transformations, improve selectivity, and access reaction pathways unavailable at ambient conditions. Critical for certain stereoselective syntheses and reactive intermediate chemistry.",
    "innovation_potential": "Medium",
    "complexity_rating": 8
  },
  {
    "technology_name": "PROTAC Synthesis Platform",
    "stage_name": "Chemical/Biological Production",
    "modality_names": [
      "PROTAC"
    ],
    "short_description": "Specialized synthesis of heterobifunctional degrader molecules",
    "description": "Sophisticated synthetic platform for assembling PROteolysis TArgeting Chimeras (PROTACs) - complex heterobifunctional molecules requiring precise conjugation of target protein ligands, linkers, and E3 ligase ligands. Demands advanced organic synthesis capabilities and specialized purification techniques.",
    "innovation_potential": "Very High",
    "complexity_rating": 9
  },
  {
    "technology_name": "Large-Scale Hydrogenation",
    "stage_name": "Chemical/Biological Production",
    "modality_names": [
      "Small Molecule"
    ],
    "short_description": "High-pressure catalytic reduction systems",
    "description": "Industrial-scale catalytic hydrogenation systems for reduction reactions in pharmaceutical synthesis. Requires specialized high-pressure equipment, catalyst handling, and hydrogen safety systems. Critical for many pharmaceutical intermediates and final API synthesis steps.",
    "innovation_potential": "Medium",
    "complexity_rating": 6
  },
  {
    "technology_name": "CHO Cell Culture Platform",
    "stage_name": "Chemical/Biological Production",
    "modality_names": [
      "Monoclonal Antibody",
      "Recombinant Proteins",
      "T-cell Engager"
    ],
    "short_description": "Chinese hamster ovary cell bioreactor systems",
    "description": "Industry-standard mammalian cell culture platform for recombinant protein production using Chinese Hamster Ovary cells, scalable from 2L to 20,000L bioreactors. CHO cells enable complex post-translational modifications including glycosylation, though glycopatterns differ from human cells. Dominates biopharmaceutical manufacturing with >70% of approved therapeutic proteins due to regulatory precedent, high productivity (1-10 g/L titers), robust growth in serum-free suspension culture, and well-characterized safety profile. Fed-batch and perfusion modes available.",
    "innovation_potential": "Medium",
    "complexity_rating": 5
  },
  {
    "technology_name": "HEK293 Cell Culture System",
    "stage_name": "Chemical/Biological Production",
    "modality_names": [
      "Gene Therapy",
      "Onkolytische Viren"
    ],
    "short_description": "Human embryonic kidney cell production platform",
    "description": "Versatile human embryonic kidney cell line adapted for suspension culture, offering high transfection efficiency and human-like glycosylation profiles. Widely used for viral vector production (AAV, lentivirus, adenovirus) and recombinant proteins requiring native human post-translational modifications including gamma-carboxylation. Produces authentic N-glycan structures lacking immunogenic epitopes (N-glycolylneuraminic acid) found in non-human cell lines. Particularly advantageous for difficult-to-express proteins and transient expression systems. Scalable to 2,000L+ in serum-free media.",
    "innovation_potential": "High",
    "complexity_rating": 6
  },
  {
    "technology_name": "Microbial Fermentation (E. coli)",
    "stage_name": "Chemical/Biological Production",
    "modality_names": [
      "Recombinant Proteins",
      "Peptides"
    ],
    "short_description": "Bacterial expression system for recombinant proteins",
    "description": "High-density bacterial fermentation using engineered Escherichia coli for rapid, cost-effective production of recombinant proteins. Advantages include fast growth rates, high yields, and well-established scalability, though limited to simpler protein structures without complex post-translational modifications.",
    "innovation_potential": "Medium",
    "complexity_rating": 4
  },
  {
    "technology_name": "Perfusion Cell Culture",
    "stage_name": "Process Intensification",
    "modality_names": [
      "Monoclonal Antibody",
      "Recombinant Proteins"
    ],
    "short_description": "Continuous cell culture with medium exchange",
    "description": "Advanced continuous bioprocessing technology maintaining cells at high density with continuous medium perfusion and product harvest. Enables steady-state operation, higher productivity per unit volume, and reduced facility footprint compared to traditional fed-batch culture.",
    "innovation_potential": "High",
    "complexity_rating": 8
  },
  {
    "technology_name": "CRISPR/Cas9 Cell Line Engineering",
    "stage_name": "Cell Line Development",
    "modality_names": [
      "CAR-T",
      "Gene Therapy",
      "Stem Cell Therapies"
    ],
    "short_description": "Precise genome editing for enhanced cell lines",
    "description": "Precision genome editing technology enabling targeted gene knockouts, knock-ins, and modifications in production cell lines and therapeutic cells. Uses programmable guide RNAs to direct Cas9 nuclease to specific genomic loci for double-strand breaks, followed by homology-directed repair or non-homologous end joining. Applications include CHO cell line optimization (gene knockout to improve glycosylation), CAR insertion at safe harbor loci (TRAC, AAVS1) for controlled expression, and T-cell engineering for enhanced functionality. Offers permanent, heritable modifications with >90% efficiency. Revolutionary impact on cell line development timelines (6-12 months vs 2+ years for traditional methods).",
    "innovation_potential": "Very High",
    "complexity_rating": 8
  },
  {
    "technology_name": "Triple Plasmid Transfection (AAV)",
    "stage_name": "Chemical/Biological Production",
    "modality_names": [
      "Gene Therapy"
    ],
    "short_description": "Adeno-associated virus vector production system",
    "description": "Specialized mammalian cell transfection process using three plasmids (Rep-Cap, helper, and transfer plasmids) to produce recombinant AAV vectors for gene therapy. Requires precise plasmid ratios, transfection optimization, and careful harvest timing to maximize vector yields.",
    "innovation_potential": "High",
    "complexity_rating": 7
  },
  {
    "technology_name": "Baculovirus-Sf9 System (AAV)",
    "stage_name": "Chemical/Biological Production",
    "modality_names": [
      "Gene Therapy"
    ],
    "short_description": "Insect cell-based AAV vector production platform",
    "description": "Alternative AAV production platform using baculovirus-infected Spodoptera frugiperda (Sf9) insect cells. Offers potential advantages in scalability and product quality compared to mammalian systems, with growing regulatory acceptance for commercial manufacturing.",
    "innovation_potential": "High",
    "complexity_rating": 7
  },
  {
    "technology_name": "Allogeneic Cell Bank Manufacturing",
    "stage_name": "Cell Line Development",
    "modality_names": [
      "Stem Cell Therapies",
      "CAR-T"
    ],
    "short_description": "Off-the-shelf therapeutic cell bank production",
    "description": "Manufacturing of standardized, donor-derived therapeutic cell banks for allogeneic cell therapy products. Involves extensive donor screening, cell isolation, genetic modification, expansion, cryopreservation, and comprehensive characterization to create treatment-ready cell products.",
    "innovation_potential": "Very High",
    "complexity_rating": 9
  },
  {
    "technology_name": "High-Performance Liquid Chromatography (HPLC)",
    "stage_name": "Chromatography & Advanced Purification",
    "modality_names": [],
    "short_description": "Precision analytical and preparative separation",
    "description": "Fundamental high-resolution separation technique essential for pharmaceutical purification and analysis. Utilizes high-pressure pumps and packed columns to achieve precise separation based on molecular interactions with stationary phase. Critical for both analytical testing and preparative purification.",
    "innovation_potential": "Low",
    "complexity_rating": 4
  },
  {
    "technology_name": "Continuous Chromatography",
    "stage_name": "Chromatography & Advanced Purification",
    "modality_names": [
      "Monoclonal Antibody",
      "Recombinant Proteins"
    ],
    "short_description": "Multi-column countercurrent purification systems",
    "description": "Advanced purification technology using multiple interconnected columns operating in continuous mode with automatic fraction recycling. Offers higher yields, improved purity, reduced buffer consumption, and smaller equipment footprint compared to traditional batch chromatography.",
    "innovation_potential": "High",
    "complexity_rating": 8
  },
  {
    "technology_name": "Crystallization & Polymorphism Control",
    "stage_name": "Physical Processing & Drying",
    "modality_names": [
      "Small Molecule"
    ],
    "short_description": "Controlled solid form and particle engineering",
    "description": "Sophisticated process for controlling crystal formation to achieve desired polymorphic form, particle size distribution, and morphology. Critical for API bioavailability, stability, and processability. Involves precise control of supersaturation, temperature profiles, and nucleation conditions.",
    "innovation_potential": "Medium",
    "complexity_rating": 7
  },
  {
    "technology_name": "Spray Drying",
    "stage_name": "Physical Processing & Drying",
    "modality_names": [
      "Small Molecule",
      "Peptides",
      "Oligonucleotides"
    ],
    "short_description": "Rapid solvent removal and particle formation",
    "description": "Advanced drying technology converting liquid feed into dry powder through atomization and hot air contact. Enables formation of amorphous solid dispersions, controlled particle size, and improved bioavailability. Critical for heat-sensitive biologics and poorly soluble compounds.",
    "innovation_potential": "Medium",
    "complexity_rating": 6
  },
  {
    "technology_name": "Depth Filtration",
    "stage_name": "Primary Recovery & Clarification",
    "modality_names": [],
    "short_description": "Multi-layer particle and cell removal system",
    "description": "Initial clarification technology using graded porosity filter media to remove cells, cell debris, and particulates from bioreactor harvest. Essential first step in downstream processing, typically achieving >95% turbidity reduction while maintaining high product recovery.",
    "innovation_potential": "Low",
    "complexity_rating": 3
  },
  {
    "technology_name": "Tangential Flow Filtration (TFF)",
    "stage_name": "Primary Recovery & Clarification",
    "modality_names": [],
    "short_description": "Cross-flow membrane concentration and diafiltration",
    "description": "Versatile membrane-based separation technology for concentration, buffer exchange, and purification of biologics. Feed flows parallel to membrane surface minimizing fouling while achieving precise molecular weight-based separations. Essential for protein concentration and formulation.",
    "innovation_potential": "Medium",
    "complexity_rating": 5
  },
  {
    "technology_name": "Protein A Affinity Chromatography",
    "stage_name": "Chromatography & Advanced Purification",
    "modality_names": [
      "Monoclonal Antibody",
      "T-cell Engager",
      "Trispecific Antibodies",
      "ADC"
    ],
    "short_description": "Antibody-specific capture chromatography",
    "description": "Industry-standard capture step for monoclonal antibody purification utilizing Staphylococcus Protein A ligand. Provides highly selective binding and elution of immunoglobulins, typically achieving >95% product recovery and significant impurity removal in single step.",
    "innovation_potential": "Low",
    "complexity_rating": 4
  },
  {
    "technology_name": "Ion Exchange Chromatography (IEX)",
    "stage_name": "Chromatography & Advanced Purification",
    "modality_names": [],
    "short_description": "Charge-based protein separation and polishing",
    "description": "Fundamental purification technique separating proteins based on surface charge interactions with charged stationary phase. Available in cation and anion exchange formats, typically used for polishing steps to remove charge variants, host cell proteins, and process-related impurities.",
    "innovation_potential": "Low",
    "complexity_rating": 4
  },
  {
    "technology_name": "Hydrophobic Interaction Chromatography (HIC)",
    "stage_name": "Chromatography & Advanced Purification",
    "modality_names": [],
    "short_description": "Hydrophobicity-based protein purification",
    "description": "Complementary separation technique utilizing hydrophobic interactions between proteins and hydrophobic ligands on stationary phase. Particularly effective for removing protein aggregates, host cell proteins, and other hydrophobic impurities while operating under mild, non-denaturing conditions.",
    "innovation_potential": "Low",
    "complexity_rating": 5
  },
  {
    "technology_name": "Mixed-Mode Chromatography",
    "stage_name": "Chromatography & Advanced Purification",
    "modality_names": [],
    "short_description": "Multi-mechanism protein purification platform",
    "description": "Advanced chromatography utilizing multiple simultaneous interaction mechanisms (ionic, hydrophobic, hydrogen bonding) to achieve superior selectivity and resolution. Enables simplified purification schemes and effective removal of difficult-to-separate impurities.",
    "innovation_potential": "Medium",
    "complexity_rating": 6
  },
  {
    "technology_name": "Size Exclusion Chromatography (SEC)",
    "stage_name": "Chromatography & Advanced Purification",
    "modality_names": [],
    "short_description": "Molecular size-based separation and polishing",
    "description": "Gentle separation technique based on molecular size differences, primarily used for final polishing to remove aggregates and fragments. Operates under mild conditions preserving protein structure and activity, essential for maintaining product quality in final purification steps.",
    "innovation_potential": "Low",
    "complexity_rating": 3
  },
  {
    "technology_name": "Antibody-Drug Conjugation (ADC)",
    "stage_name": "Conjugation & Modification",
    "modality_names": [
      "ADC"
    ],
    "short_description": "Cytotoxic drug attachment to targeting antibodies",
    "description": "Specialized bioconjugation process linking highly potent cytotoxic drugs to monoclonal antibodies via stable chemical linkers. Requires precise control of drug-to-antibody ratio (DAR), specialized containment for highly potent compounds, and sophisticated purification to achieve homogeneous products.",
    "innovation_potential": "Very High",
    "complexity_rating": 9
  },
  {
    "technology_name": "Site-Specific Conjugation",
    "stage_name": "Conjugation & Modification",
    "modality_names": [
      "ADC"
    ],
    "short_description": "Precise molecular attachment at defined sites",
    "description": "Advanced bioconjugation technology enabling attachment of drugs or labels at specific, predetermined sites on proteins. Utilizes engineered amino acids, enzymatic methods, or click chemistry to achieve homogeneous, well-defined conjugates with improved therapeutic index and reduced heterogeneity.",
    "innovation_potential": "High",
    "complexity_rating": 8
  },
  {
    "technology_name": "PEGylation",
    "stage_name": "Conjugation & Modification",
    "modality_names": [
      "Recombinant Proteins",
      "Peptides"
    ],
    "short_description": "Polyethylene glycol modification for enhanced stability",
    "description": "Established chemical modification attaching polyethylene glycol (PEG) polymers to therapeutic proteins to improve pharmacokinetics, reduce immunogenicity, and extend half-life. Requires careful PEG selection, reaction optimization, and purification to achieve desired degree of modification.",
    "innovation_potential": "Medium",
    "complexity_rating": 6
  },
  {
    "technology_name": "Low pH Viral Inactivation",
    "stage_name": "Viral Safety & Impurity Clearance",
    "modality_names": [
      "Monoclonal Antibody",
      "Recombinant Proteins"
    ],
    "short_description": "Acid treatment for viral safety assurance",
    "description": "Critical viral safety step utilizing low pH conditions (typically pH 3.5-4.0) to inactivate enveloped viruses during biologics manufacturing. Must balance effective viral clearance with preservation of product integrity, typically achieving >4 log reduction of model viruses.",
    "innovation_potential": "Low",
    "complexity_rating": 4
  },
  {
    "technology_name": "Nanofiltration (20nm)",
    "stage_name": "Viral Safety & Impurity Clearance",
    "modality_names": [],
    "short_description": "Size-based viral particle removal system",
    "description": "Physical viral clearance method using precisely-defined 20nm pore size membranes to remove viral particles while allowing therapeutic proteins to pass through. Provides size-based viral clearance independent of viral inactivation, typically achieving >4 log reduction for appropriate size viruses.",
    "innovation_potential": "Low",
    "complexity_rating": 5
  },
  {
    "technology_name": "Solvent/Detergent Treatment",
    "stage_name": "Viral Safety & Impurity Clearance",
    "modality_names": [],
    "short_description": "Chemical viral inactivation system",
    "description": "Viral safety step using tri-n-butyl phosphate (TNBP) and detergent treatment to disrupt viral envelopes and inactivate lipid-enveloped viruses. Requires subsequent removal of solvent/detergent to prevent product damage, typically achieving >6 log reduction of enveloped viruses.",
    "innovation_potential": "Low",
    "complexity_rating": 5
  },
  {
    "technology_name": "Ultracentrifugation (Viral Vectors)",
    "stage_name": "Primary Recovery & Clarification",
    "modality_names": [
      "Gene Therapy",
      "Onkolytische Viren"
    ],
    "short_description": "High-speed centrifugal viral vector purification",
    "description": "Specialized high-speed centrifugation technique for viral vector purification and concentration utilizing density gradient separation. Critical for separating full and empty viral capsids, concentrating dilute viral preparations, and achieving high-purity viral vector products for gene therapy applications.",
    "innovation_potential": "Medium",
    "complexity_rating": 7
  },
  {
    "technology_name": "Hot-Melt Extrusion (HME)",
    "stage_name": "Solid Dosage Manufacturing",
    "modality_names": [
      "Small Molecule"
    ],
    "short_description": "Continuous thermal processing for solid dosage forms",
    "description": "Advanced solvent-free continuous manufacturing technology that melts and combines drug substances with polymeric carriers using twin-screw extruders. Creates amorphous solid dispersions that enhance bioavailability of poorly soluble drugs, particularly BCS Class II compounds. Process enables real-time monitoring via PAT tools and aligns with FDA's continuous manufacturing initiatives.",
    "innovation_potential": "High",
    "complexity_rating": 7
  },
  {
    "technology_name": "Twin Screw Granulation (TSG)",
    "stage_name": "Solid Dosage Manufacturing",
    "modality_names": [
      "Small Molecule"
    ],
    "short_description": "Continuous wet granulation using corotating screws",
    "description": "Continuous granulation technology using twin-screw extruders that combines powder blending, liquid addition, and granulation in a single unit operation. Offers superior control over particle size distribution, density, and content uniformity compared to batch granulation. Critical for continuous tablet manufacturing lines with real-time process control.",
    "innovation_potential": "High",
    "complexity_rating": 7
  },
  {
    "technology_name": "Direct Compression",
    "stage_name": "Solid Dosage Manufacturing",
    "modality_names": [
      "Small Molecule"
    ],
    "short_description": "Tablet manufacturing without wet granulation",
    "description": "Streamlined tablet manufacturing process that combines powder blending with direct compression, eliminating granulation and drying steps. Requires specialized excipients with good flow and compaction properties. Offers reduced processing time, lower costs, and simplified manufacturing while maintaining tablet quality and performance.",
    "innovation_potential": "Medium",
    "complexity_rating": 4
  },
  {
    "technology_name": "Fluid Bed Coating",
    "stage_name": "Solid Dosage Manufacturing",
    "modality_names": [
      "Small Molecule"
    ],
    "short_description": "Fluidized bed particle coating technology",
    "description": "Versatile coating technology using fluidized air to suspend particles (tablets, pellets, granules) while applying functional or aesthetic coatings. Enables taste masking, controlled release, enteric protection, and moisture protection. Particularly important for multiparticulate dosage forms and modified-release formulations with precise coating control.",
    "innovation_potential": "Medium",
    "complexity_rating": 6
  },
  {
    "technology_name": "Isolator Technology (Aseptic)",
    "stage_name": "Aseptic Processing",
    "modality_names": [],
    "short_description": "Enclosed sterile processing environments",
    "description": "Advanced barrier systems creating completely sealed, contamination-free environments for sterile pharmaceutical manufacturing. Uses HEPA filtration, VHP decontamination, and glove ports to eliminate human contamination risks. Critical for injectable manufacturing, providing higher sterility assurance than traditional cleanroom environments.",
    "innovation_potential": "High",
    "complexity_rating": 8
  },
  {
    "technology_name": "Single-Use Systems (Biologics)",
    "stage_name": "Aseptic Processing",
    "modality_names": [],
    "short_description": "Disposable bioprocessing equipment systems",
    "description": "Pre-sterilized, disposable systems replacing traditional stainless-steel equipment in biologics manufacturing. Eliminates cross-contamination risks, reduces cleaning/sterilization requirements, and enables flexible production. Particularly valuable for personalized medicines and smaller batch sizes with 40% lower initial investment costs.",
    "innovation_potential": "Very High",
    "complexity_rating": 6
  },
  {
    "technology_name": "Blow-Fill-Seal (BFS)",
    "stage_name": "Primary Container Filling",
    "modality_names": [],
    "short_description": "Automated container forming, filling, and sealing",
    "description": "Integrated aseptic technology that forms plastic containers, fills with sterile product, and seals in one continuous operation without human intervention. Operates in ISO 5 environment with minimal contamination risk. Ideal for single-dose liquid pharmaceuticals, vaccines, and ophthalmics with enhanced sterility assurance.",
    "innovation_potential": "High",
    "complexity_rating": 8
  },
  {
    "technology_name": "Pre-Filled Syringe Technology",
    "stage_name": "Primary Container Filling",
    "modality_names": [],
    "short_description": "Automated syringe filling and assembly systems",
    "description": "Advanced aseptic filling technology for pre-filled syringes offering superior dosing accuracy, reduced contamination risk, and enhanced patient safety. Includes automated needle assembly, visual inspection, and packaging. Critical for biologics delivery with reduced overfill requirements and improved shelf-life stability.",
    "innovation_potential": "High",
    "complexity_rating": 7
  },
  {
    "technology_name": "Lyophilization (Freeze-Drying)",
    "stage_name": "Lyophilization & Stabilization",
    "modality_names": [
      "ADC",
      "Bacteria",
      "Gene Therapy",
      "Monoclonal Antibody",
      "Oligonucleotides",
      "Peptides",
      "Recombinant Proteins",
      "Stem Cell Therapies"
    ],
    "short_description": "Controlled freeze-drying for stability enhancement",
    "description": "Sophisticated dehydration process using controlled freezing, primary drying (sublimation), and secondary drying to remove water while preserving drug substance structure. Critical for unstable biologics, vaccines, and proteins. Extends shelf-life and enables ambient storage of temperature-sensitive products.",
    "innovation_potential": "High",
    "complexity_rating": 9
  },
  {
    "technology_name": "Auto-Injector Integration",
    "stage_name": "Container Closure & Device Integration",
    "modality_names": [],
    "short_description": "Automated self-injection device assembly",
    "description": "Advanced combination product technology integrating drug containers with sophisticated injection devices for patient self-administration. Includes spring mechanisms, safety features, and dose verification systems. Essential for high-viscosity biologics and complex delivery requirements with enhanced patient compliance.",
    "innovation_potential": "Very High",
    "complexity_rating": 9
  },
  {
    "technology_name": "Lipid Nanoparticle (LNP) Formulation",
    "stage_name": "Physical Form Development",
    "modality_names": [
      "Oligonucleotides",
      "Gene Therapy"
    ],
    "short_description": "Advanced nanoscale drug delivery systems",
    "description": "Sophisticated nanoparticle technology using ionizable lipids, helper lipids, cholesterol, and PEGylated lipids to deliver mRNA and nucleic acid therapeutics. Critical for COVID-19 vaccines and gene therapies, enabling cellular uptake and endosomal escape for therapeutic efficacy.",
    "innovation_potential": "Very High",
    "complexity_rating": 10
  },
  {
    "technology_name": "Microfluidic Mixing",
    "stage_name": "Physical Form Development",
    "modality_names": [
      "Oligonucleotides",
      "Gene Therapy"
    ],
    "short_description": "Precise microscale fluid mixing and particle formation",
    "description": "Advanced mixing technology using microchannels to control fluid dynamics and particle formation with high precision. Enables consistent production of nanoparticles, liposomes, and other drug delivery systems with narrow size distributions. Critical for LNP manufacturing and continuous crystallization processes.",
    "innovation_potential": "High",
    "complexity_rating": 8
  },
  {
    "technology_name": "Automated Visual Inspection (AVI)",
    "stage_name": "Visual Inspection & Quality Verification",
    "modality_names": [],
    "short_description": "Machine vision quality control systems",
    "description": "Advanced machine vision technology using high-resolution cameras, AI algorithms, and automated defect detection for 100% pharmaceutical product inspection. Detects particles, cosmetic defects, fill levels, and packaging integrity with superior accuracy and consistency compared to manual inspection.",
    "innovation_potential": "High",
    "complexity_rating": 7
  },
  {
    "technology_name": "Track & Trace Serialization",
    "stage_name": "Secondary Packaging & Serialization",
    "modality_names": [],
    "short_description": "Product authentication and supply chain security",
    "description": "Comprehensive serialization technology applying unique identifiers, barcodes, and aggregation data to pharmaceutical packages for anti-counterfeiting and supply chain traceability. Ensures regulatory compliance with FDA DSCSA and EU FMD requirements while enabling product authentication and recall management.",
    "innovation_potential": "High",
    "complexity_rating": 6
  },
  {
    "technology_name": "Cold Chain Monitoring",
    "stage_name": "Cold Chain & Distribution",
    "modality_names": [
      "ADC",
      "Bacteria",
      "Base/Prime Editing",
      "CAR-NK",
      "CAR-T",
      "Gene Therapy",
      "Monoclonal Antibody",
      "Oligonucleotides",
      "Peptides",
      "Radiopharmaceuticals",
      "Recombinant Proteins",
      "Stem Cell Therapies",
      "T-cell Engager",
      "TCR-T",
      "Trispecific Antibodies"
    ],
    "short_description": "Temperature-controlled logistics tracking systems",
    "description": "Advanced IoT-enabled monitoring systems using sensors, data loggers, and real-time tracking to maintain temperature integrity of biologics and vaccines during storage and transport. Includes predictive analytics, automated alerts, and continuous documentation for regulatory compliance and product efficacy.",
    "innovation_potential": "High",
    "complexity_rating": 6
  },
  {
    "technology_name": "Design of Experiments (DoE)",
    "stage_name": "Quality by Design (QbD) Implementation",
    "modality_names": [],
    "short_description": "Statistical experimental design methodology",
    "description": "Systematic statistical approach for pharmaceutical development using factorial designs, response surface methodology, and optimization to understand critical process parameters and quality attributes. Enables efficient development with fewer experiments while identifying interactions and establishing design spaces.",
    "innovation_potential": "High",
    "complexity_rating": 5
  },
  {
    "technology_name": "Process Simulation & Digital Twin",
    "stage_name": "Quality by Design (QbD) Implementation",
    "modality_names": [],
    "short_description": "Virtual process modeling and optimization",
    "description": "Advanced digital modeling technology creating virtual replicas of manufacturing processes for simulation, optimization, and predictive maintenance. Enables virtual commissioning, operator training, and continuous process improvement without physical constraints. Critical for modern pharmaceutical manufacturing optimization.",
    "innovation_potential": "Very High",
    "complexity_rating": 9
  },
  {
    "technology_name": "Near-Infrared Spectroscopy (NIR)",
    "stage_name": "Process Analytical Technology (PAT)",
    "modality_names": [],
    "short_description": "Real-time spectroscopic process monitoring",
    "description": "Non-destructive spectroscopic technology enabling real-time monitoring of pharmaceutical processes including blending, granulation, drying, and tablet compression. Provides immediate feedback on critical quality attributes like content uniformity, moisture content, and particle size without sampling.",
    "innovation_potential": "High",
    "complexity_rating": 6
  },
  {
    "technology_name": "Raman Spectroscopy (PAT)",
    "stage_name": "Process Analytical Technology (PAT)",
    "modality_names": [],
    "short_description": "Molecular fingerprinting for process control",
    "description": "Advanced spectroscopic technique providing molecular-specific information for real-time process monitoring and control. Offers superior chemical specificity for identifying polymorphs, monitoring reactions, and detecting impurities. Particularly valuable for biologics manufacturing and crystallization processes.",
    "innovation_potential": "High",
    "complexity_rating": 7
  },
  {
    "technology_name": "Focused Beam Reflectance Measurement (FBRM)",
    "stage_name": "Process Analytical Technology (PAT)",
    "modality_names": [
      "Small Molecule"
    ],
    "short_description": "Real-time particle size and count monitoring",
    "description": "In-situ probe technology measuring chord length distributions and particle counts in real-time during crystallization, granulation, and suspension processes. Enables process optimization and control without sampling. Critical for understanding particle formation kinetics and ensuring consistent product quality.",
    "innovation_potential": "Medium",
    "complexity_rating": 6
  },
  {
    "technology_name": "Multi-Attribute Method (MAM)",
    "stage_name": "Advanced Analytical Methods",
    "modality_names": [
      "Monoclonal Antibody",
      "Recombinant Proteins",
      "T-cell Engager",
      "ADC"
    ],
    "short_description": "LC-MS based multi-parameter biologics analysis",
    "description": "Advanced liquid chromatography-mass spectrometry method enabling simultaneous monitoring of multiple critical quality attributes in biologics including sequence variants, post-translational modifications, and impurities. Offers potential to replace multiple conventional analytical methods with single, highly specific assay.",
    "innovation_potential": "Very High",
    "complexity_rating": 9
  },
  {
    "technology_name": "Capillary Electrophoresis (CE)",
    "stage_name": "Advanced Analytical Methods",
    "modality_names": [],
    "short_description": "High-resolution electrophoretic separation technique",
    "description": "Advanced separation technology offering high-efficiency analysis of proteins, peptides, and small molecules using electric field migration in narrow-bore capillaries. Provides superior resolution for charge variants, glycoforms, and purity assessment with minimal sample requirements and high throughput capabilities.",
    "innovation_potential": "Medium",
    "complexity_rating": 6
  },
  {
    "technology_name": "Solid-Phase Peptide Synthesis (SPPS)",
    "stage_name": "Chemical/Biological Production",
    "modality_names": [
      "Peptides"
    ],
    "short_description": "Stepwise chemical assembly of peptides on a solid support resin.",
    "description": "Stepwise chemical assembly of peptides on a solid support resin using protected amino acid building blocks. The process involves repetitive cycles of deprotection and coupling reactions, typically using Fmoc or Boc protecting group strategies. SPPS enables automated synthesis of peptides up to 50+ amino acids with high purity, and is the dominant platform technology for peptide manufacturing in both research and commercial production. The solid-phase approach allows simple purification by filtration, driving reactions to completion with excess reagents.",
    "innovation_potential": "Medium",
    "complexity_rating": 6
  },
  {
    "technology_name": "Amorphous Solid Dispersion (ASD) Technology",
    "stage_name": "Physical Form Development",
    "modality_names": [
      "Molecular Glues",
      "PROTAC",
      "Small Molecule"
    ],
    "short_description": "Advanced formulation dispersing poorly soluble APIs in an amorphous polymer matrix.",
    "description": "Advanced formulation technology that disperses poorly water-soluble APIs in an amorphous form within a polymer matrix carrier to enhance bioavailability. The polymer stabilizes the high-energy amorphous state, prevents recrystallization, and improves dissolution rates by 10-100 fold compared to crystalline forms. Manufacturing methods include hot-melt extrusion, spray drying, and solvent-based techniques. Critical for addressing the ~40% of drug candidates with poor aqueous solubility.",
    "innovation_potential": "High",
    "complexity_rating": 8
  },
  {
    "technology_name": "Aseptic Container Filling",
    "stage_name": "Primary Container Filling",
    "modality_names": [
      "ADC",
      "Base/Prime Editing",
      "Gene Therapy",
      "Monoclonal Antibody",
      "Oligonucleotides",
      "Peptides",
      "Radiopharmaceuticals",
      "Recombinant Proteins",
      "Stem Cell Therapies",
      "T-cell Engager",
      "Trispecific Antibodies"
    ],
    "short_description": "Sterile filling of products into primary containers under aseptic conditions.",
    "description": "Sterile filling of pharmaceutical products into primary containers (vials, syringes, cartridges) under aseptic conditions in Grade A environments. Encompasses multiple container types and technologies including rotary piston pumps, peristaltic pumps, and time-pressure systems for accurate fill volumes from <0.5mL to >50mL. Critical for biologics and injectables requiring terminal sterilization-incompatible formulations. Integrated with isolator or RABS containment systems.",
    "innovation_potential": "Medium",
    "complexity_rating": 7
  },
  {
    "technology_name": "Controlled-Rate Cryopreservation",
    "stage_name": "Container Closure & Device Integration",
    "modality_names": [
      "CAR-T",
      "CAR-NK",
      "Stem Cell Therapies",
      "TCR-T"
    ],
    "short_description": "Programmable freezing using computer-controlled cooling rates to minimize cellular damage.",
    "description": "Programmable freezing technology using computer-controlled cooling rates (typically -1°C/min) to optimize ice crystal formation and minimize cellular damage during cryopreservation. Controlled-rate freezers (CRFs) continuously adjust temperature decline based on actual specimen temperature, compensating for latent heat of fusion and minimizing supercooling effects. Superior to passive freezing methods, CRF achieves 30-50% higher cell viability and recovery for cell therapy products, critical for maintaining product potency and therapeutic efficacy.",
    "innovation_potential": "High",
    "complexity_rating": 8
  },
  {
    "technology_name": "Bioconjugation Chemistry",
    "stage_name": "Conjugation & Modification",
    "modality_names": [
      "ADC",
      "Oligonucleotides",
      "Peptides",
      "PROTAC"
    ],
    "short_description": "Chemical strategies forming stable covalent linkages between biomolecules and synthetics.",
    "description": "Chemical strategies forming stable covalent linkages between biomolecules and synthetic moieties, including lysine/cysteine-targeted conjugation, click chemistry, and enzymatic methods. Enables attachment of cytotoxic payloads to antibodies (ADCs), PEGylation for half-life extension, GalNAc conjugation for hepatocyte targeting, and linker chemistry for PROTACs. Selectivity, reaction efficiency, and product homogeneity are critical parameters. Site-specific conjugation methods offer improved therapeutic index by controlling drug-to-antibody ratios.",
    "innovation_potential": "Very High",
    "complexity_rating": 8
  },
  {
    "technology_name": "Mammalian Cell Line Engineering",
    "stage_name": "Cell Line Development",
    "modality_names": [
      "ADC",
      "Monoclonal Antibody",
      "Recombinant Proteins",
      "T-cell Engager",
      "Trispecific Antibodies"
    ],
    "short_description": "Genetic modification of mammalian expression systems to enhance protein production.",
    "description": "Genetic modification and optimization of mammalian expression systems (CHO, HEK293) to enhance recombinant protein production. Encompasses CRISPR/Cas9 gene editing, stable transfection, clonal selection, and metabolic engineering to improve titer, product quality, glycosylation profiles, and cell growth characteristics. CHO cells dominate for mAb production due to scalability and regulatory precedent, while HEK293 offers superior human-like glycosylation for complex proteins requiring native post-translational modifications.",
    "innovation_potential": "High",
    "complexity_rating": 7
  },
  {
    "technology_name": "Phosphoramidite Chemistry (Oligonucleotide Synthesis)",
    "stage_name": "Chemical/Biological Production",
    "modality_names": [
      "Oligonucleotides",
      "Base/Prime Editing"
    ],
    "short_description": "Gold-standard solid-phase synthesis of DNA and RNA oligonucleotides.",
    "description": "Gold-standard solid-phase synthesis of DNA and RNA oligonucleotides using nucleoside phosphoramidite building blocks. The automated synthesis cycle proceeds 3' to 5' with four key steps: detritylation, coupling, capping, and oxidation, achieving >99% coupling efficiency per cycle. Enables synthesis of therapeutic oligonucleotides up to 200+ bases with precise sequence control. Critical for antisense oligonucleotides, siRNAs, and guide RNAs. Modern modifications include 2'-O-methyl, 2'-F, and phosphorothioate backbones for enhanced stability.",
    "innovation_potential": "Medium",
    "complexity_rating": 6
  },
  {
    "technology_name": "Automated Radiosynthesis",
    "stage_name": "Conjugation & Modification",
    "modality_names": [
      "Radiopharmaceuticals"
    ],
    "short_description": "Computer-controlled synthesis modules for GMP-compliant radiopharmaceutical production.",
    "description": "Computer-controlled synthesis modules operating within lead-shielded hot cells for GMP-compliant radiopharmaceutical production. Automated systems integrate radionuclide purification, radiolabeling reactions (fluorination, radiometallation, radioiodination), purification, and formulation with typical synthesis times of 10-60 minutes. Cassette-based or fixed-design platforms minimize operator radiation exposure and ensure batch-to-batch reproducibility. Essential for short-lived isotopes (18F t½=110min, 68Ga t½=68min) requiring rapid synthesis-to-patient workflows.",
    "innovation_potential": "High",
    "complexity_rating": 9
  },
  {
    "technology_name": "Radiolabeling Chemistry",
    "stage_name": "Conjugation & Modification",
    "modality_names": [
      "Radiopharmaceuticals"
    ],
    "short_description": "Specialized chemistry attaching radioactive isotopes to targeting molecules.",
    "description": "Specialized conjugation chemistry attaching radioactive isotopes to targeting molecules (peptides, antibodies, small molecules) for diagnostic imaging or therapeutic applications. Key methods include direct radioiodination, radiometal chelation via bifunctional chelators (DOTA, DTPA), and nucleophilic/electrophilic fluorination. Reactions optimized for high radiochemical yield (>90%), high specific activity, and rapid kinetics compatible with isotope half-lives. Critical parameters include pH, temperature, precursor concentration, and reaction time.",
    "innovation_potential": "Very High",
    "complexity_rating": 9
  },
  {
    "technology_name": "GalNAc Conjugation Technology",
    "stage_name": "Physical Form Development",
    "modality_names": [
      "Oligonucleotides"
    ],
    "short_description": "Trivalent N-acetylgalactosamine conjugation for hepatocyte-targeted delivery.",
    "description": "Trivalent N-acetylgalactosamine (tri-GalNAc) conjugation to oligonucleotides for hepatocyte-targeted delivery via asialoglycoprotein receptor (ASGPR) binding. GalNAc-siRNA conjugates enable subcutaneous administration with 10-fold potency enhancement over unconjugated forms, achieving highly efficient liver uptake and long duration of action (monthly to biannual dosing). Conjugation performed either on-column during solid-phase synthesis or post-synthetically. Superior to LNP delivery for liver-targeted therapeutics with reduced toxicity and simpler manufacturing.",
    "innovation_potential": "Very High",
    "complexity_rating": 7
  },
  {
    "technology_name": "Lentiviral Vector Production",
    "stage_name": "Chemical/Biological Production",
    "modality_names": [
      "CAR-T",
      "CAR-NK",
      "TCR-T",
      "Gene Therapy",
      "Stem Cell Therapies"
    ],
    "short_description": "Large-scale manufacture of lentiviral vectors for cell and gene therapy.",
    "description": "Large-scale manufacture of lentiviral vectors for cell and gene therapy using transient transfection of HEK293 suspension cells. The third-generation safety design splits viral components across 3-4 plasmids to prevent replication-competent virus formation. Production involves plasmid transfection (calcium phosphate or PEI methods), viral particle harvest (48-72h post-transfection), concentration, and chromatographic purification. Scalable from shake flasks to 200L bioreactors. Titers typically 10^7-10^9 TU/mL. Critical for ex vivo T-cell transduction in CAR-T manufacturing.",
    "innovation_potential": "Very High",
    "complexity_rating": 9
  },
  {
    "technology_name": "Viral Transduction (T-Cell/NK-Cell)",
    "stage_name": "Chemical/Biological Production",
    "modality_names": [
      "CAR-T",
      "CAR-NK",
      "TCR-T"
    ],
    "short_description": "Gene transfer technology delivering CAR/TCR constructs into immune cells.",
    "description": "Gene transfer technology delivering CAR or TCR constructs into activated T cells or NK cells using gamma-retroviral or lentiviral vectors. Process involves T-cell activation (anti-CD3/CD28), viral vector exposure (MOI 1-10), and spinoculation or static transduction with enhancers (Vectofusin, RetroNectin) to achieve 50-90% transduction efficiency. Transduction timing (day 1-3 post-activation), cytokine milieu (IL-2, IL-7, IL-15), and vector concentration are critical for maintaining central memory phenotype and functional potency. Stable genomic integration enables persistent CAR expression.",
    "innovation_potential": "Very High",
    "complexity_rating": 8
  },
  {
    "technology_name": "T-Cell Expansion (Ex Vivo)",
    "stage_name": "Upstream Processing",
    "modality_names": [
      "CAR-T",
      "TCR-T"
    ],
    "short_description": "Large-scale expansion of genetically modified T cells in bioreactors.",
    "description": "Large-scale expansion of genetically modified T cells from 10^6 to 10^9+ cells over 7-14 days in bioreactors or closed-system devices. Utilizes activation signals (anti-CD3/CD28 beads), cytokine supplementation (IL-2, IL-7, IL-15, IL-21), and gas-permeable culture systems to drive T-cell proliferation while maintaining effector function. Automated platforms (CliniMACS Prodigy, Cocoon) integrate activation, transduction, expansion, and formulation in a closed system. Critical quality attributes include CAR expression, T-cell phenotype (central vs effector memory), and viability.",
    "innovation_potential": "Very High",
    "complexity_rating": 9
  },
  {
    "technology_name": "NK Cell Expansion",
    "stage_name": "Upstream Processing",
    "modality_names": [
      "CAR-NK"
    ],
    "short_description": "Ex vivo expansion of natural killer cells using cytokine stimulation.",
    "description": "Ex vivo expansion of natural killer cells from peripheral blood, cord blood, or iPSC sources using cytokine stimulation (IL-2, IL-15, IL-21) and feeder cells (irradiated PBMCs, K562 cells expressing membrane-bound IL-21). Achieves 15-1000 fold expansion over 14-21 days while maintaining cytotoxic function and activating receptor expression (NKG2D, DNAM-1). Automated GMP platforms enable reproducible manufacturing of allogeneic \"off-the-shelf\" NK cell products. Critical for CAR-NK production with lower GVHD risk compared to T cells.",
    "innovation_potential": "High",
    "complexity_rating": 8
  },
  {
    "technology_name": "Bacterial Fermentation Platform",
    "stage_name": "Chemical/Biological Production",
    "modality_names": [
      "Bacteria",
      "Recombinant Proteins"
    ],
    "short_description": "High-density cultivation of engineered bacterial strains for recombinant protein production.",
    "description": "High-density cultivation of engineered bacterial strains (E. coli, Bacillus) for recombinant protein production in controlled bioreactors. Fed-batch or continuous fermentation achieves cell densities >100 g/L dry cell weight with doubling times of 20-60 minutes. BSL-2 containment and specialized strain engineering enable rapid, cost-effective production of simple proteins, peptides, and therapeutic enzymes. Requires downstream refolding for disulfide-bonded proteins and endotoxin removal. Scalable from 10L to 10,000L+ with productivity advantages over mammalian systems for simpler products.",
    "innovation_potential": "Low",
    "complexity_rating": 4
  },
  {
    "technology_name": "Cell Line Stability & Banking",
    "stage_name": "Cell Line Development",
    "modality_names": [
      "ADC",
      "Bacteria",
      "Base/Prime Editing",
      "CAR-NK",
      "CAR-T",
      "Gene Therapy",
      "Monoclonal Antibody",
      "Oligonucleotides",
      "Peptides",
      "Radiopharmaceuticals",
      "Recombinant Proteins",
      "Small Molecule",
      "Stem Cell Therapies",
      "T-cell Engager",
      "TCR-T",
      "Trispecific Antibodies"
    ],
    "short_description": "Systematic generation, characterization, and storage of cell banks per ICH guidelines.",
    "description": "Systematic generation, characterization, and storage of Master Cell Banks (MCB) and Working Cell Banks (WCB) per ICH Q5A/Q5B guidelines. Encompasses genetic stability testing, identity verification, sterility testing, mycoplasma testing, and adventitious agent testing. Cryopreservation protocols optimized for each cell type ensure multi-generational consistency. Critical for regulatory compliance and manufacturing reproducibility. MCB typically contains 100-200 vials stored at -150°C or below, providing 20-30+ years of manufacturing capacity.",
    "innovation_potential": "Low",
    "complexity_rating": 5
  },
   {
    "technology_name": "Vero/BHK Cell Culture System (HSV-1)",
    "stage_name": "Chemical/Biological Production",
    "modality_names": [
      "Onkolytische Viren"
    ],
    "short_description": "Adherente Zellkulturplattform für Herpes-simplex-Virus-Vektoren",
    "description": "Etablierte, regulatorisch anerkannte Zelllinien (z.B. Vero, BHK) für die GMP-konforme Produktion von HSV-1-basierten onkolytischen Viren wie T-VEC. Die Zellen werden typischerweise in adherenter Kultur geführt, können aber für größere Maßstäbe auf Suspensionsprozesse adaptiert werden.",
    "innovation_potential": "Medium",
    "complexity_rating": 7
  },
  {
    "technology_name": "Plaque-Forming Unit (PFU) Assay",
    "stage_name": "Advanced Analytical Methods",
    "modality_names": [
      "Onkolytische Viren",
      "Gene Therapy"
    ],
    "short_description": "Funktioneller Goldstandard-Assay zur Quantifizierung infektiöser Viruspartikel",
    "description": "Ein biologischer Potenz-Assay, der die Anzahl der infektiösen, replikationskompetenten Viruspartikel in einer Probe misst. Das Ergebnis (PFU/mL) ist ein kritischer Qualitätsparameter und für die Freigabe und Dosierung von viralen Vektoren regulatorisch erforderlich.",
    "innovation_potential": "Low",
    "complexity_rating": 6
  },
  {
    "technology_name": "Quantitative PCR (qPCR) for Genome-Titer",
    "stage_name": "Advanced Analytical Methods",
    "modality_names": [
      "Onkolytische Viren",
      "Gene Therapy"
    ],
    "short_description": "Molekularbiologische Methode zur Messung der Gesamtanzahl viraler Genome",
    "description": "Eine schnelle und hochsensitive Methode zur Bestimmung der Konzentration viraler Genome (vg/mL) in einer Probe. Sie wird zur Prozessüberwachung und zur Berechnung des Verhältnisses von Gesamtpartikeln zu infektiösen Partikeln (vg/PFU Ratio) verwendet, was ein wichtiges Qualitätsattribut darstellt.",
    "innovation_potential": "Medium",
    "complexity_rating": 5
  }
]